In [69]:
import pandas as pd
df = pd.read_excel(r"G:/temp/Sample_Data.xlsx")
df.head()

,Client Name,Account ID,Legal Entity,Currency,Payment Type,Paid Amount,Payment Date,Payment Status
0,JPM CHASE,375803,CitiBank NA New York Branch,USD,R,30000.0,2019-01-07,RESOLVED
1,JPM CHASE,375803,CitiBank NA New York Branch,USD,R,40000.0,2019-01-10,RESOLVED
2,JPM CHASE,375803,CitiBank NA New York Branch,USD,D,40000.0,2019-01-17,RESOLVED
3,JPM CHASE,375803,CitiBank NA New York Branch,USD,D,30000.0,2019-01-23,RESOLVED
4,HDFC BANK LTD-MUMBAI HEAD OFFICE,383857,CitiBank NA New York Branch,INR,R,37660000.0,2019-01-28,RESOLVED

In [70]:
def modify(x):
    x = str(x).lower()
    x = x.replace(" ","")
    x = x.replace("-","")
    x = x.replace("branch","")
    return x

In [71]:
modify(" Citi-Bank LondOn brAnch")

'citibanklondon'

In [72]:
df['Client Name'] = df['Client Name'].apply(modify)
df['Legal Entity'] = df['Legal Entity'].apply(modify)
df.drop(['Account ID'], axis=1, inplace = True)

In [73]:
df.head()

,Client Name,Legal Entity,Currency,Payment Type,Paid Amount,Payment Date,Payment Status
0,jpmchase,citibanknanewyork,USD,R,30000.0,2019-01-07,RESOLVED
1,jpmchase,citibanknanewyork,USD,R,40000.0,2019-01-10,RESOLVED
2,jpmchase,citibanknanewyork,USD,D,40000.0,2019-01-17,RESOLVED
3,jpmchase,citibanknanewyork,USD,D,30000.0,2019-01-23,RESOLVED
4,hdfcbankltdmumbaiheadoffice,citibanknanewyork,INR,R,37660000.0,2019-01-28,RESOLVED

In [74]:
from datetime import datetime

In [75]:
df['Payment Date'] = df['Payment Date'].apply(lambda x : datetime.strptime(str(x).replace(" 00:00:00",""),"%Y-%m-%d"))

In [76]:
df.head()

,Client Name,Legal Entity,Currency,Payment Type,Paid Amount,Payment Date,Payment Status
0,jpmchase,citibanknanewyork,USD,R,30000.0,2019-01-07,RESOLVED
1,jpmchase,citibanknanewyork,USD,R,40000.0,2019-01-10,RESOLVED
2,jpmchase,citibanknanewyork,USD,D,40000.0,2019-01-17,RESOLVED
3,jpmchase,citibanknanewyork,USD,D,30000.0,2019-01-23,RESOLVED
4,hdfcbankltdmumbaiheadoffice,citibanknanewyork,INR,R,37660000.0,2019-01-28,RESOLVED

In [77]:
df.set_index("Payment Date",inplace = True)

In [78]:
df.tail()

,Client Name,Legal Entity,Currency,Payment Type,Paid Amount,Payment Status
Payment Date,,,,,,
2020-06-23,hdfcbankltdmumbaiheadoffice,citibanknanewyork,INR,D,65440000.0,RESOLVED
2020-06-24,jpmchase,citibanknanewyork,USD,R,50000.0,RESOLVED
2020-06-24,bankofbarodamumbaiheadoffice,citibankbombay,INR,D,26680000.0,RESOLVED
2020-06-25,jpmchase,citibanknanewyork,USD,D,30000.0,PENDING_COLLATERAL
2020-06-25,hdfcbankltdmumbaiheadoffice,citibanknanewyork,INR,D,21790000.0,PENDING_COLLATERAL

In [79]:
#df.to_csv(r'G:/temp/processed_data.csv')

In [80]:
df = df[df['Payment Status'] == 'RESOLVED']

In [81]:
from random import randint
def change(x):
    li = [d for d in str(x)]
    l = li[:3]
    l.append(str(randint(0,9)) + str(randint(0,9)))
    x = int("".join(l))
    return x

In [82]:
import numpy as np
newdf = pd.DataFrame(np.repeat(df.values,3,axis=0))
newdf.columns = df.columns
newdf.index = list(df.index) * 3
newdf['Paid Amount'] = newdf['Paid Amount'].apply(change)
df = newdf

In [83]:
#df[df['Payment Type'] == 'D'].loc[:,'Paid Amount'] = df[df['Payment Type'] == 'D']['Paid Amount']*(-1)

In [84]:
#df['Paid Amount'] = df['Paid Amount'].apply(lambda x : -x if df.loc[df['Paid Amount'],'Payment Type'] == 'D' else x)

In [85]:
df['Paid Amount'].where(df['Payment Type']!='D', (-1)*df['Paid Amount'], inplace = True)
df['Paid Amount'].where(df['Currency']!='INR', (0.013)*df['Paid Amount'], inplace = True)
df['Paid Amount'].where(df['Currency']!='GBP', (1.24) * df['Paid Amount'], inplace = True)

In [86]:
df.drop(['Payment Type','Payment Status','Currency'], axis = 1, inplace = True)

In [87]:
print(df.head())
print(df.tail())

           Client Name       Legal Entity  Paid Amount
2019-01-07    jpmchase  citibanknanewyork      30059.0
2019-01-10    jpmchase  citibanknanewyork      30084.0
2019-01-17    jpmchase  citibanknanewyork      30058.0
2019-01-23    jpmchase  citibanknanewyork      40099.0
2019-01-28    jpmchase  citibanknanewyork      40078.0
                             Client Name       Legal Entity  Paid Amount
2020-06-19                      jpmchase  citibanknanewyork    50039.000
2020-06-22                      jpmchase  citibanknanewyork    50036.000
2020-06-23  bankofbarodamumbaiheadoffice     citibankbombay     -346.112
2020-06-24  bankofbarodamumbaiheadoffice     citibankbombay     -346.814
2020-06-24  bankofbarodamumbaiheadoffice     citibankbombay     -345.826

In [71]:
df.to_csv(r'G:/temp/processed_data.csv')